multiSpeciesMassTransportLibrary/testCases/modifiedReactingFoam_mixing_maxwell/0/CH4
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.2-devel                             |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";


    class volScalarField;
    object CH4;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inletAir
    {
        type            fixedValue;
        value           uniform 0;
    }

    inletFuel
    {
        type            fixedValue;
        value           uniform 0.0523;
    }
    
    outlet          
    {
        type            zeroGradient;
    }
    
    wallBetween
    {
        type            zeroGradient;
    }

    side
    {
        type            symmetryPlane;
    }

    down
    {
        type            symmetryPlane;
    }
    
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
